software/monad-challenges/set1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-06-09 Thu 09:04 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Problem Set 1</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Stefano Rodighiero" />
<meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link href="http://stefanorodighiero.net/css/notes2.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/wiki/monad-challenges/"> UP </a>
 |
 <a accesskey="H" href="http://stefanorodighiero.net/"> HOME </a>
</div><div id="content">
<h1 class="title">Problem Set 1</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Random number generation</a></li>
<li><a href="#orgheadline2">2. Random character generation</a></li>
<li><a href="#orgheadline3">3. More generators</a></li>
<li><a href="#orgheadline4">4. Generalizing random pairs</a></li>
<li><a href="#orgheadline5">5. Generalizing lists of generators</a></li>
<li><a href="#orgheadline6">6. Threading the random number state</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Random number generation</h2>
<div class="outline-text-2" id="text-1">
<p>
First exercise is simple. The text says not to try to do anything
fancy. Well, I'm not sure what's the opposite of fancy, but it should
be my forte. Here a solution:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #006699;">fiveRands</span> <span style="color: #BA36A5;">::</span> [<span style="color: #6434A3;">Integer</span>]
<span style="color: #006699;">fiveRands</span> <span style="color: #BA36A5;">=</span> [
  fst <span style="color: #BA36A5;">$</span> rand <span style="color: #BA36A5;">$</span> mkSeed 1,
  fst <span style="color: #BA36A5;">$</span> rand <span style="color: #BA36A5;">$</span> snd <span style="color: #BA36A5;">$</span> rand <span style="color: #BA36A5;">$</span> mkSeed 1,
  fst <span style="color: #BA36A5;">$</span> rand <span style="color: #BA36A5;">$</span> snd <span style="color: #BA36A5;">$</span> rand <span style="color: #BA36A5;">$</span> snd <span style="color: #BA36A5;">$</span> rand <span style="color: #BA36A5;">$</span> mkSeed 1,
  fst <span style="color: #BA36A5;">$</span> rand <span style="color: #BA36A5;">$</span> snd <span style="color: #BA36A5;">$</span> rand <span style="color: #BA36A5;">$</span> snd <span style="color: #BA36A5;">$</span> rand <span style="color: #BA36A5;">$</span> snd <span style="color: #BA36A5;">$</span> rand <span style="color: #BA36A5;">$</span> mkSeed 1,
  fst <span style="color: #BA36A5;">$</span> rand <span style="color: #BA36A5;">$</span> snd <span style="color: #BA36A5;">$</span> rand <span style="color: #BA36A5;">$</span> snd <span style="color: #BA36A5;">$</span> rand <span style="color: #BA36A5;">$</span> snd <span style="color: #BA36A5;">$</span> rand <span style="color: #BA36A5;">$</span> snd <span style="color: #BA36A5;">$</span> rand <span style="color: #BA36A5;">$</span> mkSeed 1]
</pre>
</div>

<p>
However, it's easy to spot a common pattern in the list of function
compositions. A shorter, more general version:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #006699;">fiveRands</span>' <span style="color: #BA36A5;">::</span> [<span style="color: #6434A3;">Integer</span>]
<span style="color: #006699;">fiveRands</span>' <span style="color: #BA36A5;">=</span> map fst <span style="color: #BA36A5;">$</span> take 5 <span style="color: #BA36A5;">$</span> iterate (rand <span style="color: #BA36A5;">.</span> snd) <span style="color: #BA36A5;">$</span> rand <span style="color: #BA36A5;">$</span> mkSeed 1
</pre>
</div>

<p>
I was initially surprised to see it working, since the first element
on the array in the first defition is <code>fst $ rand $ mkSeed 1</code>, that
is, there's no occurrence of the composite function <code>(rand
. snd)</code>. But it all makes sense if you observe the definition of
<code>iterate</code>.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Random character generation</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #006699;">randLetter</span> <span style="color: #BA36A5;">::</span> <span style="color: #6434A3;">Seed</span> <span style="color: #BA36A5;">-&gt;</span> (<span style="color: #6434A3;">Char</span>, <span style="color: #6434A3;">Seed</span>)
<span style="color: #006699;">randLetter</span> seed <span style="color: #BA36A5;">=</span> (toLetter <span style="color: #BA36A5;">$</span> fst r, snd r)
  <span style="color: #0000FF;">where</span> r <span style="color: #BA36A5;">=</span> rand seed

<span style="color: #006699;">randString3</span> <span style="color: #BA36A5;">::</span> <span style="color: #6434A3;">String</span>
<span style="color: #006699;">randString3</span> <span style="color: #BA36A5;">=</span> map fst <span style="color: #BA36A5;">$</span> take 3 <span style="color: #BA36A5;">$</span> iterate (randLetter <span style="color: #BA36A5;">.</span> snd) <span style="color: #BA36A5;">$</span> randLetter <span style="color: #BA36A5;">$</span> mkSeed 1
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> More generators</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #0000FF;">type</span> <span style="color: #6434A3;">Gen</span> a <span style="color: #BA36A5;">=</span> <span style="color: #6434A3;">Seed</span> <span style="color: #BA36A5;">-&gt;</span> (a, <span style="color: #6434A3;">Seed</span>)
<span style="color: #006699;">myRand</span> <span style="color: #BA36A5;">::</span> <span style="color: #6434A3;">Gen</span> <span style="color: #6434A3;">Integer</span>
<span style="color: #006699;">myRand</span> <span style="color: #BA36A5;">=</span> rand

<span style="color: #006699;">myRandLetter</span> <span style="color: #BA36A5;">::</span> <span style="color: #6434A3;">Gen</span> <span style="color: #6434A3;">Char</span>
<span style="color: #006699;">myRandLetter</span> <span style="color: #BA36A5;">=</span> randLetter

<span style="color: #006699;">generalA</span> <span style="color: #BA36A5;">::</span> (a <span style="color: #BA36A5;">-&gt;</span> b) <span style="color: #BA36A5;">-&gt;</span> <span style="color: #6434A3;">Gen</span> a <span style="color: #BA36A5;">-&gt;</span> <span style="color: #6434A3;">Gen</span> b
<span style="color: #006699;">generalA</span> f g seed <span style="color: #BA36A5;">=</span> (f <span style="color: #BA36A5;">$</span> fst r, snd r)
  <span style="color: #0000FF;">where</span> r <span style="color: #BA36A5;">=</span> g seed

<span style="color: #006699;">randEven</span> <span style="color: #BA36A5;">::</span> <span style="color: #6434A3;">Gen</span> <span style="color: #6434A3;">Integer</span> <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">the output of rand * 2</span>
<span style="color: #006699;">randEven</span> <span style="color: #BA36A5;">=</span> generalA (<span style="color: #BA36A5;">\</span>x <span style="color: #BA36A5;">-&gt;</span> x <span style="color: #BA36A5;">*</span> 2) myRand

<span style="color: #006699;">randOdd</span> <span style="color: #BA36A5;">::</span> <span style="color: #6434A3;">Gen</span> <span style="color: #6434A3;">Integer</span> <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">the output of rand * 2 + 1</span>
<span style="color: #006699;">randOdd</span> <span style="color: #BA36A5;">=</span> generalA (<span style="color: #BA36A5;">\</span>x <span style="color: #BA36A5;">-&gt;</span> x <span style="color: #BA36A5;">*</span> 2 <span style="color: #BA36A5;">+</span> 1) myRand

<span style="color: #006699;">randTen</span> <span style="color: #BA36A5;">::</span> <span style="color: #6434A3;">Gen</span> <span style="color: #6434A3;">Integer</span> <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">the output of rand * 10</span>
<span style="color: #006699;">randTen</span> <span style="color: #BA36A5;">=</span> generalA (<span style="color: #BA36A5;">\</span>x <span style="color: #BA36A5;">-&gt;</span> x <span style="color: #BA36A5;">*</span> 10) myRand
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> Generalizing random pairs</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #006699;">randPair</span> <span style="color: #BA36A5;">::</span> <span style="color: #6434A3;">Gen</span> (<span style="color: #6434A3;">Char</span>, <span style="color: #6434A3;">Integer</span>)
<span style="color: #006699;">randPair</span> seed <span style="color: #BA36A5;">=</span> ((fst l, fst n), snd n)
  <span style="color: #0000FF;">where</span> l <span style="color: #BA36A5;">=</span> randLetter seed
        n <span style="color: #BA36A5;">=</span> rand <span style="color: #BA36A5;">$</span> snd l

<span style="color: #006699;">generalPair</span> <span style="color: #BA36A5;">::</span> <span style="color: #6434A3;">Gen</span> a <span style="color: #BA36A5;">-&gt;</span> <span style="color: #6434A3;">Gen</span> b <span style="color: #BA36A5;">-&gt;</span> <span style="color: #6434A3;">Gen</span> (a, b)
<span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">generalPair :: (Seed -&gt; (a, Seed)) -&gt; (Seed -&gt; (b, Seed)) -&gt; Seed -&gt; ((a,b), Seed)</span>
<span style="color: #006699;">generalPair</span> gena genb seed <span style="color: #BA36A5;">=</span> ((a, b), seed'')
  <span style="color: #0000FF;">where</span> ra     <span style="color: #BA36A5;">=</span> gena seed
        a      <span style="color: #BA36A5;">=</span> fst ra
        seed'  <span style="color: #BA36A5;">=</span> snd ra
        rb     <span style="color: #BA36A5;">=</span> genb seed'
        b      <span style="color: #BA36A5;">=</span> fst rb
        seed'' <span style="color: #BA36A5;">=</span> snd rb

<span style="color: #006699;">randPair</span>' <span style="color: #BA36A5;">=</span> generalPair randLetter rand
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">5</span> Generalizing lists of generators</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #006699;">repRandom</span> <span style="color: #BA36A5;">::</span> [<span style="color: #6434A3;">Gen</span> a] <span style="color: #BA36A5;">-&gt;</span> <span style="color: #6434A3;">Gen</span> [a]
<span style="color: #006699;">repRandom</span> <span style="color: #6434A3;">[]</span> seed <span style="color: #BA36A5;">=</span> (<span style="color: #6434A3;">[]</span>, seed)  <span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">not sure about this equation</span>
<span style="color: #006699;">repRandom</span> (g<span style="color: #6434A3;">:</span>gs) seed <span style="color: #BA36A5;">=</span> (a <span style="color: #6434A3;">:</span> fst (repRandom gs seed'), seed')
  <span style="color: #0000FF;">where</span> ra <span style="color: #BA36A5;">=</span> g seed
        a <span style="color: #BA36A5;">=</span> fst ra
        seed' <span style="color: #BA36A5;">=</span> snd ra
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">6</span> Threading the random number state</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #006699;">genTwo</span> <span style="color: #BA36A5;">::</span> <span style="color: #6434A3;">Gen</span> a <span style="color: #BA36A5;">-&gt;</span> (a <span style="color: #BA36A5;">-&gt;</span> <span style="color: #6434A3;">Gen</span> b) <span style="color: #BA36A5;">-&gt;</span> <span style="color: #6434A3;">Gen</span> b
<span style="color: #006699;">genTwo</span> gen f seed <span style="color: #BA36A5;">=</span> f a seed
  <span style="color: #0000FF;">where</span> ra    <span style="color: #BA36A5;">=</span> gen seed
        a     <span style="color: #BA36A5;">=</span> fst ra
        seed' <span style="color: #BA36A5;">=</span> snd ra

<span style="color: #006699;">mkGen</span> <span style="color: #BA36A5;">::</span> a <span style="color: #BA36A5;">-&gt;</span> <span style="color: #6434A3;">Gen</span> a
<span style="color: #8D8D84;">-- </span><span style="color: #8D8D84; font-style: italic;">mkGen :: a -&gt; Seed -&gt; (a, Seed)</span>
<span style="color: #006699;">mkGen</span> a seed <span style="color: #BA36A5;">=</span> (a, seed)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-02-13 Sat&gt;</span></span></p>
<p class="author">Author: Stefano Rodighiero</p>
<p class="date">Created: 2016-06-09 Thu 09:04</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
